In [1]:
sc

In [2]:
spark

In [3]:
people_df = spark.read.json("file:///home/hadoop/Downloads/People.json")
people_df.head()

Row(city='Mulyosari', country='Indonesia', first_name='Valma', gender='Female', id=1, last_name='Sans', salary=983107)

In [4]:
people_df.show()

+------------------+------------+----------+------+---+---------+------+
|              city|     country|first_name|gender| id|last_name|salary|
+------------------+------------+----------+------+---+---------+------+
|         Mulyosari|   Indonesia|     Valma|Female|  1|     Sans|983107|
|           Niihama|       Japan|     Paolo|  Male|  2|   Kiddie|649173|
|         Dū Qal‘ah| Afghanistan|    Miltie|  Male|  3| De Zuani|352898|
|            Iberia|        Peru|    Jarrid|  Male|  4| Dalziell|170398|
|          La Ronge|      Canada| Reinaldos|  Male|  5|   Keeffe|440989|
|      Kuala Lumpur|    Malaysia|        Eb|  Male|  6|Schwanden|274126|
|         Al Qurayn|Saudi Arabia|    Alleyn|  Male|  7|   Paddon|681914|
|           Jixiang|       China|   Baryram|  Male|  8|     Yell|250748|
|Thị Trấn Phong Thổ|     Vietnam|     Cammy|Female|  9|     Axel|221750|
|        Kotatengah|   Indonesia|       Erl|  Male| 10|  Caldera|680801|
|        Roldanillo|    Colombia|    Miguel|  Male| 11|   Moules|819771|
|            Malārd|        Iran| Mireielle|Female| 12|   Hurley|486029|
|     Fada N'gourma|Burkina Faso|    Feodor|  Male| 13| Grummitt|358045|
|           Ciangir|   Indonesia|     Diana|Female| 14|  Lawfull|397683|
|         El Cantón|   Venezuela|      Evie|Female| 15|   Kaysor|436202|
|          La Unión|    Colombia|    Janean|Female| 16|    Sayse|892405|
|            Xinhua|       China|     Colan|  Male| 17|   Stoppe|218434|
|     Крива Паланка|   Macedonia|      Erik|  Male| 18| Stitcher|776023|
|          Qīr Moāv|      Jordan|   Sargent|  Male| 19|   Cleall|819269|
|      Bogandinskiy|      Russia|   Tamqrah|Female| 20|Millichip|313540|
+------------------+------------+----------+------+---+---------+------+
only showing top 20 rows

In [5]:
bank_data = spark.read.json("file:///home/hadoop/Downloads/bank_edited.json", multiLine=True)
bank_data.head()

Row(age=58, balance=2143, campaign=1, contact='unknown', day=5, default='no', duration=261, education='tertiary', housing='yes', job='management', loan='no', marital='married', month='may', pdays=-1, poutcome='unknown', previous=0, y='no')

In [7]:
bank_data.show()

+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|         job|loan| marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|  management|  no| married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|  technician|  no|  single|  may|   -1| unknown|       0| no|
| 33|      2|       1|unknown|  5|     no|      76|secondary|    yes|entrepreneur| yes| married|  may|   -1| unknown|       0| no|
| 47|   1506|       1|unknown|  5|     no|      92|  unknown|    yes| blue-collar|  no| married|  may|   -1| unknown|       0| no|
| 33|      1|       1|unknown|  5|     no|     198|  unknown|     no|     unknown|  no|  single|  may|   -1| unknown|       0| no|
| 35|    231|       1|unknown|  5|     no|     139| tertiary|    yes|  management|  no| married|  may|   -1| unknown|       0| no|
| 28|    447|       1|unknown|  5|     no|     217| tertiary|    yes|  management| yes|  single|  may|   -1| unknown|       0| no|
| 42|      2|       1|unknown|  5|    yes|     380| tertiary|    yes|entrepreneur|  no|divorced|  may|   -1| unknown|       0| no|
| 58|    121|       1|unknown|  5|     no|      50|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 43|    593|       1|unknown|  5|     no|      55|secondary|    yes|  technician|  no|  single|  may|   -1| unknown|       0| no|
| 41|    270|       1|unknown|  5|     no|     222|secondary|    yes|      admin.|  no|divorced|  may|   -1| unknown|       0| no|
| 29|    390|       1|unknown|  5|     no|     137|secondary|    yes|      admin.|  no|  single|  may|   -1| unknown|       0| no|
| 53|      6|       1|unknown|  5|     no|     517|secondary|    yes|  technician|  no| married|  may|   -1| unknown|       0| no|
| 58|     71|       1|unknown|  5|     no|      71|  unknown|    yes|  technician|  no| married|  may|   -1| unknown|       0| no|
| 57|    162|       1|unknown|  5|     no|     174|secondary|    yes|    services|  no| married|  may|   -1| unknown|       0| no|
| 51|    229|       1|unknown|  5|     no|     353|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 45|     13|       1|unknown|  5|     no|      98|  unknown|    yes|      admin.|  no|  single|  may|   -1| unknown|       0| no|
| 57|     52|       1|unknown|  5|     no|      38|  primary|    yes| blue-collar|  no| married|  may|   -1| unknown|       0| no|
| 60|     60|       1|unknown|  5|     no|     219|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 33|      0|       1|unknown|  5|     no|      54|secondary|    yes|    services|  no| married|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
only showing top 20 rows

In [8]:
bank_data.printSchema()

root
 |-- age: long (nullable = true)
 |-- balance: long (nullable = true)
 |-- campaign: long (nullable = true)
 |-- contact: string (nullable = true)
 |-- day: long (nullable = true)
 |-- default: string (nullable = true)
 |-- duration: long (nullable = true)
 |-- education: string (nullable = true)
 |-- housing: string (nullable = true)
 |-- job: string (nullable = true)
 |-- loan: string (nullable = true)
 |-- marital: string (nullable = true)
 |-- month: string (nullable = true)
 |-- pdays: long (nullable = true)
 |-- poutcome: string (nullable = true)
 |-- previous: long (nullable = true)
 |-- y: string (nullable = true)

#### 1. Create a schema with defined fields in desired order and desired DType.

In [11]:
from pyspark.sql.functions import *
from pyspark.sql.types import IntegerType, StructType, StructField, StringType, FloatType
from pyspark.sql.types import *

In [24]:
schema = StructType([
    StructField("id", IntegerType(), True),
    StructField("first_name", StringType(), True),
    StructField("last_name", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", LongType(), True),
    StructField("city", StringType(), True),
    StructField("country", StringType(), True),
])

In [25]:
people_df = spark.read.schema(schema).json("file:///home/hadoop/Downloads/People.json")

In [26]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+
| id|first_name|last_name|gender|salary|              city|     country|
+---+----------+---------+------+------+------------------+------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|
+---+----------+---------+------+------+------------------+------------+
only showing top 20 rows

In [27]:
people_df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)

#### 2. withColumn()

In [28]:
# here with column will create new column name "new_salary"
people_df = people_df.withColumn('new_salary', people_df['salary'] + people_df['salary'] * 0.1)

In [29]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+----------+
| id|first_name|last_name|gender|salary|              city|     country|new_salary|
+---+----------+---------+------+------+------------------+------------+----------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia| 1081417.7|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|  714090.3|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|  388187.8|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|  187437.8|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|  485087.9|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|  301538.6|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|  750105.4|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|  275822.8|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|  243925.0|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|  748881.1|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|  901748.1|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|  534631.9|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|  393849.5|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|  437451.3|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|  479822.2|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|  981645.5|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|  240277.4|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|  853625.3|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|  901195.9|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|  344894.0|
+---+----------+---------+------+------+------------------+------------+----------+
only showing top 20 rows

In [30]:
# Limit - To Limit first 5 records
people_df.limit(5).show()

+---+----------+---------+------+------+---------+-----------+----------+
| id|first_name|last_name|gender|salary|     city|    country|new_salary|
+---+----------+---------+------+------+---------+-----------+----------+
|  1|     Valma|     Sans|Female|983107|Mulyosari|  Indonesia| 1081417.7|
|  2|     Paolo|   Kiddie|  Male|649173|  Niihama|      Japan|  714090.3|
|  3|    Miltie| De Zuani|  Male|352898|Dū Qal‘ah|Afghanistan|  388187.8|
|  4|    Jarrid| Dalziell|  Male|170398|   Iberia|       Peru|  187437.8|
|  5| Reinaldos|   Keeffe|  Male|440989| La Ronge|     Canada|  485087.9|
+---+----------+---------+------+------+---------+-----------+----------+

#### 3. Random Sampling of Data from Sample Method

In [37]:
people_df.sample(withReplacement=False, fraction=0.1, seed = 123).show()

+---+----------+---------+------+------+---------------+--------------+----------+
| id|first_name|last_name|gender|salary|           city|       country|new_salary|
+---+----------+---------+------+------+---------------+--------------+----------+
| 14|     Diana|  Lawfull|Female|397683|        Ciangir|     Indonesia|  437451.3|
| 35|  Germayne|  Tremeer|  Male|920086|     eSikhawini|  South Africa| 1012094.6|
| 47|   Olivier|   Shewon|  Male|244655|         Kolaka|     Indonesia|  269120.5|
| 61|      Farr|  Dymocke|  Male|616185|      Lenningen|    Luxembourg|  677803.5|
| 69|Ermentrude|  Teffrey|Female| 96039|          Tiron|     Indonesia|  105642.9|
| 87|  Maryanna|  Petchey|Female|853991|       Subotica|        Serbia|  939390.1|
| 89|     Jayme| Brunotti|Female|881570|        Marston|United Kingdom|  969727.0|
|101|    Fredia| Reinhard|Female|644592|Belén de Umbría|      Colombia|  709051.2|
|108|     Meier|  Lavalle|  Male|635366|        Midrand|  South Africa|  698902.6|
|138|   Kirstyn| Izkovici|Female|606642|      Jembangan|     Indonesia|  667306.2|
|156| Antonella|    Gaule|Female|856946|         Gunung|     Indonesia|  942640.6|
|168|     Natal|  Eilhart|  Male|921191|       Houxiang|         China| 1013310.1|
|172|    Arlyne|   Gander|Female|933482|        Legaspi|   Philippines| 1026830.2|
|177|    Durand|   Plevin|  Male|151677|          Kinna|        Sweden|  166844.7|
|179|     Bucky|   Engley|  Male|593031|  Ollantaytambo|          Peru|  652334.1|
|191|  Benedick|   Farans|  Male|682446|          Deder|      Ethiopia|  750690.6|
|209|    Valene|      Say|Female|476333|       Daykitin|   Philippines|  523966.3|
|211|     Danya|  Simenon|Female|369820|        Gibsons|        Canada|  406802.0|
|227|     Margo|Hairsnape|Female|225392|        Kanshan|         China|  247931.2|
|230|    Andrea|    Becks|  Male|764222|        Tubajon|   Philippines|  840644.2|
+---+----------+---------+------+------+---------------+--------------+----------+
only showing top 20 rows

#### OrderBy()
    * Arrange data in ascending or descending Order.

In [38]:
people_df.orderBy(['salary', 'first_name'], ascending = True).show()

+---+----------+----------+------+------+------------+--------------------+----------+
| id|first_name| last_name|gender|salary|        city|             country|new_salary|
+---+----------+----------+------+------+------------+--------------------+----------+
| 93|      Cory|     Prigg|  Male| 12876|     Gondang|           Indonesia|   14163.6|
|590|      Flem|  Tumielli|  Male| 13347| Debre Zeyit|            Ethiopia|   14681.7|
|192|       Odo|   Conyers|  Male| 15555|  Raffingora|            Zimbabwe|   17110.5|
|407|  Barbabas| Ballingal|  Male| 18598|Beringinjaya|           Indonesia|   20457.8|
|297|     Daron|    Melato|Female| 19881|      Phayao|            Thailand|   21869.1|
| 24|   Avigdor|   Goddman|  Male| 20216|       Gujun|               China|   22237.6|
|315|    Alayne|    Foskin|Female| 20390|     Siluman|           Indonesia|   22429.0|
|199|     Niles| Atcherley|  Male| 22529|Nova Venécia|              Brazil|   24781.9|
|294|     Terri|    Holton|Female| 23934|      Hitura|               Nepal|   26327.4|
|601|    Pattie|Bosomworth|Female| 24967|   Virolahti|             Finland|   27463.7|
|762|     Jesse|   Comfort|  Male| 26213|    Żoliborz|              Poland|   28834.3|
|252|       Gil|  Rochford|  Male| 26950|        Huji|               China|   29645.0|
|837|   Sharity|  Stoffers|Female| 28630|    Zavidovo|              Russia|   31493.0|
|438|    Odelle|  Harefoot|Female| 29177| Cibatuireng|           Indonesia|   32094.7|
|836|     Lenka|  Eddicott|Female| 29374| Trincomalee|           Sri Lanka|   32311.4|
|912|    Jackie|    Baudic|Female| 29540|       Bunia|Democratic Republ...|   32494.0|
|439|     Keith|   Baudain|  Male| 31890| Maszkienice|              Poland|   35079.0|
|356| Raffaello|   Dugdale|  Male| 33082|   San Pedro|         Philippines|   36390.2|
|977|    Kalvin|     Earry|  Male| 34152|   Mariental|             Namibia|   37567.2|
|512|     Bobbe|   Copland|Female| 34435|          Mó|            Portugal|   37878.5|
+---+----------+----------+------+------+------------+--------------------+----------+
only showing top 20 rows

In [40]:
people_df.orderBy(['first_name', 'salary'], ascending = False).show()

+---+----------+-------------+------+------+--------------------+-----------+----------+
| id|first_name|    last_name|gender|salary|                city|    country|new_salary|
+---+----------+-------------+------+------+--------------------+-----------+----------+
| 99|    Zondra|      Gisburn|Female|698909|       Крива Паланка|  Macedonia|  768799.9|
|572|      Zerk|        Bohin|  Male|853249|           Purwodadi|  Indonesia|  938573.9|
|874| Zackariah|     Trebbett|  Male|643036|          Las Palmas|     Mexico|  707339.6|
|620|  Zacharie|Grzegorzewski|  Male|934644|Santa Cruz de Guacas|  Venezuela| 1028108.4|
|879|  Zaccaria|       Leagas|  Male|695307|             Xam Nua|       Laos|  764837.7|
|448|      Yuri|      Duggary|  Male|414107|       Sang-e Māshah|Afghanistan|  455517.7|
|310|      Yuma|      Brogden|  Male|363880|              Ottawa|     Canada|  400268.0|
|911|  Yovonnda|        Adran|Female|482705|        Buturlinovka|     Russia|  530975.5|
|202|      Yard|      Harback|  Male|657091|        Zachepylivka|    Ukraine|  722800.1|
|735|      Yank|     Paddeley|  Male|241820|            Lumbatan|Philippines|  266002.0|
|831|    Xerxes|    Decayette|  Male|208784|Brejo da Madre de...|     Brazil|  229662.4|
|659|   Xaviera|      Stoller|Female|162466|             Dachong|      China|  178712.6|
|459|     Wynny|      Bilovus|Female|538074|              Madala|    Nigeria|  591881.4|
|243|      Wynn|   Smitherham|Female|508138|          Tambakrejo|  Indonesia|  558951.8|
|141|     Worth|       Betser|  Male|192268|Saint-Quentin-en-...|     France|  211494.8|
|330|  Winthrop|       Pippin|  Male|527636|              Mesógi|     Cyprus|  580399.6|
|362|   Winston|      Tweedie|  Male|828472|           Tempaling|  Indonesia|  911319.2|
|727|  Winifred|         Birt|Female|179174|             Shijing|      China|  197091.4|
|371|     Windy|         Mila|Female|641693|              Tembol|  Indonesia|  705862.3|
|396|    Wilton|         Hoyt|  Male|866057|               Vyksa|     Russia|  952662.7|
+---+----------+-------------+------+------+--------------------+-----------+----------+
only showing top 20 rows